{
    "example":
    {
        "BOARD_ID":
        {
            "title": "Component Type/Function",
            "manf" : "Manufacturer",
            "serial": "Serial Number or Component Type",
            "datasheet": ["http://URL/TO/REPO/DATASHEET/FILE_NAME.pdf", "FILE_NAME.pdf"],
            "detail": "Succint overview of component and what it does (or what we believe it to do)."
        }
    },
    
    "peb":
    {
        "J1":
        {
            "title": "External Pins",
            "manf": "PEB",
            "serial": "External Access Pins",
            "datasheet": ["#", "None"],
            "detail": "These 7 pins are used to interact with the microcontroller. Their primary function use is to read and reprogram the chip using the In-Circuit Serial Programming (ICSP) protocol. Unfortunately, the original firmware was read-protected, so we were not able to decompile the original software."
        },
        "S1":
        {
            "title": "Magnetic Field Switch",
            "manf": "Unknown",
            "serial": "magnetic field switch",
            "datasheet": ["#", "None"],
            "detail": "As the name suggests, the magnetic field switch engages when it is placed close to a magnet, such as the one inside the iVotronic's PEB receptacle, and sends power to the PEB's components, effectively powering on the handheld device."
        },
        "T1":
        {
            "title": "MOS Field-Effect Transistor",
            "manf": "ON Semiconductor",
            "serial": "NTMS10P02R2",
            "datasheet": ["https://github.com/SCCapstone/omaha/blob/master/peb/datasheets/T1_E10P02.pdf", "T1_E10P02.pdf"],
            "detail": "A metal-oxide-semiconductor field-effect transistor (or MOSFET) is one of the most common types of transistors in use. Although specifics are not known, this component is involved with the PEB's IR communications."
        },
        "U1":
        {
            "title": "8-Bit Microcontroller",
            "manf": "Microchip Technology",
            "serial": "PIC16F873",
            "datasheet": ["https://github.com/SCCapstone/omaha/blob/master/peb/datasheets/U1_PIC16F87X.pdf", "U1_PIC16F87X.pdf"],
            "detail": "The microcontroller is the most important component on the board: it is what implements the logic needed to get the board functioning through interoperating with the other components on the board. Its primary function is to communicate with the iVotronic to manage ballot and vote information. Furthermore, it can be programmed via the external port (marked J1) using the In-Circuit Serial Programming (ICSP) protocol."
        },
        "U2":
        {
            "title": "16-Megabit DataFlash&reg; Chip",
            "manf": "Atmel",
            "serial": "AT45DB161B",
            "datasheet": ["https://github.com/SCCapstone/omaha/blob/master/peb/datasheets/U2_AT45DB161B.pdf", "U2_AT45DB161B.pdf"],
            "detail": "The DataFlash memory chip stores 16 megabits (2 megabytes) of information used by the PEB, and it communicates with the microcontroller via the Serial Peripheral Interface (SPI) protocol. Specifically, this chip stores all of the information needed for an election ballot: candidate information, precinct information, and&mdash;most importantly&mdash;vote totals. More chips can be added to the device for redundancy."
        },
        "U4":
        {
            "title": "IrDA&trade; Encoder/Decoder",
            "manf": "Texas Instruments",
            "serial": "TIR1000",
            "datasheet": ["https://github.com/SCCapstone/omaha/blob/master/peb/datasheets/U4_TIR1000.pdf", "U4_TIR1000.pdf"],
            "detail": "The IrDA&trade; Encode/Decoder acts an intermediary between the microcontroller (U2) and the infrared tranceiver (U7). It translates between the raw data used by the controller (sent via the UART/USART protocol) and the IrDA&trade; packets sent and recieved by the transceiver. IrDA&trade; is a standard protocol for transimitting information via infrared light."
        },
        "U7":
        {
            "title": "Infrared Transceiver",
            "manf": "Vishay Semiconductors",
            "serial": "TFDU4100",
            "datasheet": ["https://github.com/SCCapstone/omaha/blob/master/peb/datasheets/U7_TFDU4100.pdf", "U7_TFDU4100.pdf"],
            "detail": "The infrared (IR) transceiver is the lowest-level interface between the PEB and the iVotronic voting machine. It sends and receives packets of information that are encoded and decoded by the IrDA&trade; en-/decoder."
        },
        "U8":
        {
            "title": "Dual D-Type Flip-Flops",
            "manf": "Texas Instruments",
            "serial": "SN74HC74",
            "datasheet": ["https://github.com/SCCapstone/omaha/blob/master/peb/datasheets/U8_SN74HC74.pdf", "U8_SN74HC74.pdf"],
            "detail": "The two <a href=\"https://en.wikipedia.org/wiki/Flip-flop_(electronics)#D_flip-flop\">D flip-flops</a> on this component are connected in series to step down the 7.37-MHz clock signal generated by the oscillator (component Y1) by a factor of 4 to 1.84-MHz for the IrDA$trade; en-/decoder."
        },
        "Y1":
        {
            "title": "7.37-Megahertz Crystal Oscillator",
            "manf": "Generic",
            "serial": "crystal oscillator",
            "datasheet": ["#", "None"],
            "detail": "This a an external clock component with respect to the microcontroller, which has an internal clock. It is a generic crystal oscillator that emits a 7.3728-MHz clock signal that is used to synchronize all of the components on the board to ensure proper data exchange during IR communication."
        }
    },
    
    "ivo":
    {
        
    },
    
    "ivoIR":
    {
        
    },
    
    "ivoMem":
    {
        
    },
    
    "ivoSound":
    {
        
    }
}